name: "AlexNet_dynamic_test"
layer {
  name: "accuracy"
  type: "Python"
  top: "accuracy"
  top: "mae"
  top: "rmse"
  python_param {
    module: "correlation"
    layer: "CorrelationLayer"
    param_str: "{\'network_file\': \'./alexnet-deploy-dy.prototxt\', \'snapshot_prefix\': \'./snapshot/1/alex-dy_iter_\',\'snapshot_iter\': 5000, \'mean_file\': \'../../data/1/256_train_mean.binaryproto\', \'roots\': \'../../data/faces/\', \'file\': \'../../data/1/test_1.txt\'}"
  }
}
